{"meta":{"title":"D Blog","subtitle":null,"description":null,"author":"Doddy Rizal Novianto","url":"http://yoursite.com"},"pages":[{"title":"ABOUT","date":"2018-12-24T13:48:42.000Z","updated":"2018-12-24T13:51:24.505Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Blog iseng tempat saya menulis apa yang saya mau."}],"posts":[{"title":"Membuat Blog Dengan Hexo","slug":"hello-world","date":"2018-12-21T17:00:00.000Z","updated":"2018-12-27T10:53:07.146Z","comments":true,"path":"2018/12/22/hello-world/","link":"","permalink":"http://yoursite.com/2018/12/22/hello-world/","excerpt":"","text":"Disini saya mau membahas tentang bagaimana sih membuat blog dengan Hexo, untuk penjelasan lebih lanjut tentang Hexo tidak akan saya tulis disini, jadi silahkan baca sendiri ya. Dokumentasi tentang Hexo bisa dibaca disini. Jika ada masalah saat menggunakan Hexo bisa dibaca disini. Langsung aja kita mulai. Oiya, pastikan di sistem kita sudah terinstall NodeJS dan npm, cara installnya bisa dibaca disini untuk NodeJS dan disini untuk npm. TutorialnyaInstall Hexo dan Inisialisasi BlogKita install Hexo di sistem kita dengan perintah ini.1$ sudo npm install hexo-cli -g lalu buat folder yang akan kita jadikan repository lokal blog kita.1$ hexo init namablog namablog itu bisa kalian ganti sesuai keinginan, selanjutnya masuk ke direktori blog kalian.12$ cd namablog$ npm install selamat kalian sudah berhasil membuat blog kalian dengan Hexo, lanjut ke tahap selanjutnya. Membuat PostinganUntuk membuat postingan kalian bisa menggunakan perintah ini.1$ hexo new \"judul postingan\" secara otomatis, Hexo akan membuat file “judul postingan.md” pada direktori source/_post. Lalu jika kita ingin membuat sebuah draft atau halaman khusus untuk blog kita, kita bisa menggunakan perintah.1$ hexo new draft \"judul draft\" atau1$ hexo new page \"judul halaman\" penjelasan lainnya tentang membuat postingan bisa kalian baca disini. Menjalankan ServerDengan Hexo, kita dapat melihat preview blog kita sebelum diluncurkan atau kita deploy ke GitHub dengan menggunakan perintah ini.$ hexo server atau $ hexo server --draft untuk melihat preview blog kita beserta file yang masih menjadi draft. Perintah ini akan membuka tautan http://localhost:4000/ dan kita dapat membukanya melalui browser kesayangan. Generate dan DeployLangkah selanjutnya setelah membuat postingan dan menjalankan server yaitu generate dan deploy, perintah ini akan mempublish tulisan kita ke repo GitHub agar dapat ditampilkan seperti blog pada umumnya, tapi sebelum itu kita install dahulu plugin hexo-deployer-plugin agar mempermudah proses deploy, caranya cukup jalankan perintah ini $ npm install hexo-deployer-git --save . Jika sudah, kita edit berkas _config.yml dan tambahkan data ini di dalamnya. 12345deploy: type: git repo: https://github.com/username/username.github.io branch: master message: \"&#123;&#123; now('YYYY-MM-DD HH:mm:ss') &#125;&#125; \" lalu kalian bisa menjalankan perintah generate dan deploy12$ hexo generate$ hexo deploy Informasi lainnya bisa kalian baca disini Deployment dan disini Generate. Selamat, blog kita sudah tayang dan dapat diakses oleh semua orang!Terima kasih kepada para pembaca, semoga tulisan saya ini bermanfaat dan tidak membuat bingung hehe, jika ada pertanyaan atau bingung silahkan tinggalkan komentar dibawah, sampai jumpa di tulisan selanjutnya.","categories":[{"name":"tutorial","slug":"tutorial","permalink":"http://yoursite.com/categories/tutorial/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"}]}]}