{"meta":{"title":"D Blog","subtitle":null,"description":null,"author":"Doddy Rizal Novianto","url":"https://drzaln.github.io"},"pages":[{"title":"ABOUT","date":"2018-12-24T13:48:42.000Z","updated":"2018-12-28T08:11:41.769Z","comments":true,"path":"about/index.html","permalink":"https://drzaln.github.io/about/index.html","excerpt":"","text":"Blog iseng tempat saya menulis apa yang saya mau.Kenal saya lebih lanjut die-mail | telegram | instagram"}],"posts":[{"title":"Membuat PWA Dengan Hexo","slug":"Membuat-PWA-Dengan-Hexo","date":"2018-12-28T06:15:06.000Z","updated":"2018-12-28T07:14:32.502Z","comments":true,"path":"2018/12/28/Membuat-PWA-Dengan-Hexo/","link":"","permalink":"https://drzaln.github.io/2018/12/28/Membuat-PWA-Dengan-Hexo/","excerpt":"","text":"Halo halo, selamat siang!Jadi begini, kemarin saya iseng cari-cari plugin Hexo buat blog ini, nah saya nemu satu plugin yang menarik, namanya hexo-pwa, plugin ini akan membuat blog kita menjadi PWA. Apasih PWA itu? Menurut situs chromeplex, PWA adalah web yang dibuat agar pengguna bisa merasakan experience dari aplikasi native, jadi nanti web yang sudah mendukung PWA punya banyak kelebihan, antara lain adanya fitur add to Homescreen, instant loading, dan kelebihan lainnya. Lalu bagaimana caranya agar blog Hexo kita bisa menjadi PWA? TutorialnyaInstall PluginPertama kita harus masuk dulu ke direktori blog kita.1$ cd direktoriBlog Jika sudah didalam direktori blog kita, jalankan perintah ini untuk menginstall plugin hexo-pwa.1$ npm install --save hexo-pwa Configure PluginKalau sudah plugin sudah terinstall, kita bisa menambahkan baris kode berikut ini kedalam file _config.yml.1234567891011121314151617181920212223242526272829303132pwa: manifest: path: /manifest.json body: name: hexo short_name: hexo #ini menjadi nama di homescreen icons: #src icon bisa diganti sesuai keinginan - src: /images/android-chrome-192x192.png sizes: 192x192 type: image/png - src: /images/android-chrome-512x512.png sizes: 512x512 type: image/png theme_color: '#ffffff' background_color: '#ffffff' display: standalone serviceWorker: path: /sw.js preload: urls: - / posts: 5 opts: networkTimeoutSeconds: 5 routes: - pattern: !!js/regexp /hm.baidu.com/ strategy: networkOnly - pattern: !!js/regexp /.*\\.(js|css|jpg|jpeg|png|gif)$/ strategy: cacheFirst - pattern: !!js/regexp /\\// strategy: networkFirst priority: 5 Baris kode itu akan membuat file manifest.json yang akan mengatur bagaimana tampilan icon blog kita saat ditaruh ke homescreen smartphone. Audit Dengan Lighthouse (Optional)Jika sudah selesai setting plugin, kita bisa mengaudit blog kita dengan Lighthouse. Jika menggunakan browser Chrome, fitur ini sudah tersedia di bagian audits pada Developer Tools, klik saja Run audits dan Chrome akan melakukan analisa terhadap blog kita. Ini hasil audit dari blog sayaLumayanlah hehe. Menggunakan Add to HomescreenIni fitur yang paling saya suka dari PWA, jadi nanti blog yang kita taruh di homescreen smartphone kita akan otomatis mempunyai splash screen dan address bar yang berada diatas browser akan hilang.Karena plugin ini belum sempurna, jadi kita harus menambah secara manual blog kita ini ke homescreen dengan cara klik tombol titik 3 di kanan atas -&gt; add to homescreen. Oiya, disini saya baru mencoba browser Chrome di android, sebenarnya Chrome akan otomatis mendeteksi dan akan memberikan prompt jika suatu web sudah mendukung PWA, tetapi karena plugin ini belum sempurna jadi kita harus menggunakan fitur Add to Homescreen secara manual. Oke cukup itu saja tutorial yang saya bagi hari ini, masih banyak plugin menarik dari Hexo yang mau saya ulik-ulik, jika ada pertanyaan atau bingung, silahkan tinggalkan komentar, terima kasih. Sampai ketemu di tulisan selanjutnya. Pengumuman Jekyll ternyata juga punya plugin PWA, hehe.","categories":[{"name":"tutorial","slug":"tutorial","permalink":"https://drzaln.github.io/categories/tutorial/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://drzaln.github.io/tags/hexo/"}]},{"title":"Membuat Blog Dengan Hexo","slug":"hello-world","date":"2018-12-21T17:00:00.000Z","updated":"2018-12-27T11:52:14.399Z","comments":true,"path":"2018/12/22/hello-world/","link":"","permalink":"https://drzaln.github.io/2018/12/22/hello-world/","excerpt":"","text":"Disini saya mau membahas tentang bagaimana sih membuat blog dengan Hexo, untuk penjelasan lebih lanjut tentang Hexo tidak akan saya tulis disini, jadi silahkan baca sendiri ya. Dokumentasi tentang Hexo bisa dibaca disini. Jika ada masalah saat menggunakan Hexo bisa dibaca disini. Langsung aja kita mulai. Oiya, pastikan di sistem kita sudah terinstall NodeJS dan npm, cara installnya bisa dibaca disini untuk NodeJS dan disini untuk npm. TutorialnyaInstall Hexo dan Inisialisasi BlogKita install Hexo di sistem kita dengan perintah ini.1$ sudo npm install hexo-cli -g lalu buat folder yang akan kita jadikan repository lokal blog kita.1$ hexo init namablog namablog itu bisa kalian ganti sesuai keinginan, selanjutnya masuk ke direktori blog kalian.12$ cd namablog$ npm install selamat kalian sudah berhasil membuat blog kalian dengan Hexo, lanjut ke tahap selanjutnya. Menambah TemaKita pasti ingin dong tampilan blog kita bagus, oleh karena itu kita perlu menambahkan tema pada blog kita, Hexo sendiri sudah menyediakan tema untuk blog kita, jadi kita tidak perlu membuat tampilan sendiri dengan HTML dan CSS, semua tema itu bisa kita akses disini. Lalu clone tema dengan perintah.1$ git clone https://github.com/namaTema themes/namaTema selain dengan perintah clone bisa juga diunduh dan di ekstrak ke dalam direktori themes, jangan lupa membaca dokumentasi dari setiap tema karena pengaturan tiap tema berbeda-beda. Membuat PostinganUntuk membuat postingan kalian bisa menggunakan perintah ini.1$ hexo new \"judul postingan\" secara otomatis, Hexo akan membuat file “judul postingan.md” pada direktori source/_post. Lalu jika kita ingin membuat sebuah draft atau halaman khusus untuk blog kita, kita bisa menggunakan perintah.1$ hexo new draft \"judul draft\" atau1$ hexo new page \"judul halaman\" penjelasan lainnya tentang membuat postingan bisa kalian baca disini. Menjalankan ServerDengan Hexo, kita dapat melihat preview blog kita sebelum diluncurkan atau kita deploy ke GitHub dengan menggunakan perintah ini.$ hexo server atau $ hexo server --draft untuk melihat preview blog kita beserta file yang masih menjadi draft. Perintah ini akan membuka tautan http://localhost:4000/ dan kita dapat membukanya melalui browser kesayangan. Generate dan DeployLangkah terakhir yaitu generate dan deploy, perintah ini akan mempublish tulisan kita ke repo GitHub agar dapat ditampilkan seperti blog pada umumnya, tapi sebelum itu kita install dahulu plugin hexo-deployer-plugin agar mempermudah proses deploy, caranya cukup jalankan perintah ini $ npm install hexo-deployer-git --save . Jika sudah, kita edit berkas _config.yml dan tambahkan data ini di dalamnya. 12345deploy: type: git repo: https://github.com/username/username.github.io branch: master message: \"&#123;&#123; now('YYYY-MM-DD HH:mm:ss') &#125;&#125; \" lalu kalian bisa menjalankan perintah generate dan deploy12$ hexo generate$ hexo deploy Informasi lainnya bisa kalian baca disini Deployment dan disini Generate. Selamat, blog kita sudah tayang dan dapat diakses oleh semua orang!Terima kasih kepada para pembaca, semoga tulisan saya ini bermanfaat dan tidak membuat bingung hehe, jika ada pertanyaan atau bingung silahkan tinggalkan komentar dibawah, sampai jumpa di tulisan selanjutnya.","categories":[{"name":"tutorial","slug":"tutorial","permalink":"https://drzaln.github.io/categories/tutorial/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://drzaln.github.io/tags/hexo/"}]}]}